---
kind: type
id: T:Autodesk.Revit.DB.ConnectorProfileType
source: html/94482e32-e0e3-2340-c23c-6cef9348434e.htm
---
# Autodesk.Revit.DB.ConnectorProfileType

An enumerated type listing all connector profile types

## Syntax (C#)
```csharp
public enum ConnectorProfileType
```